{"Routine": "Make sure you are up-to-date on routine vaccines before every trip. These vaccines include measles-mumps-rubella (MMR) vaccine, diphtheria-tetanus-pertussis vaccine, varicella (chickenpox) vaccine, polio vaccine, and your yearly flu shot.",
    "Hepatitis A": "CDC recommends this vaccine because you can get hepatitis A through contaminated food or water, regardless of where you are eating or staying.",
    "Typhoid": "You can get typhoid through contaminated food or water. CDC recommends this vaccine for most travelers, especially if you are staying with friends or relatives, visiting smaller cities or rural areas, or if you are an adventurous eater.",
    "Poliomyelitis": "You may need a polio vaccine before your trip.",
    "Hepatitis B": "You can get hepatitis B through sexual contact, contaminated needles, and blood products, so CDC recommends this vaccine if you might have sex with a new partner, get a tattoo or piercing, or have any medical procedures.",
    "Malaria": "You may need to take prescription medicine before, during, and after your trip to prevent malaria, especially if you are visiting low-altitude areas.",
    "Rabies": "Although rabies can be found in dogs, bats, and other mammals, it is not a major risk to most travelers. A vaccine is recommended if travelers are involved in outdoor and other activities in remote areas that put them at risk for animal bites (such as adventure travel and caving).",
    "Yellow Fever": "If you are traveling from a country other than the US, check with a doctor or the CDC to see if you may be required to get the yellow fever vaccine.",
    "Japanese encephalitis": "You may need this vaccine if your trip will last more than a month, depending on where you are going.",
    "Meningococcal disease": "CDC recommends this vaccine if you plan to visit areas located in the meningitis belt during the dry season (December–June), when the disease is most common.",
    "Cholera": "CDC recommends this vaccine for adults who are traveling to areas of active cholera transmission."}